Subregions must be in the same Design Option as their Toposurface.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId SiteRegionOptionConflict { get; }
  Visual Basic
Public Shared ReadOnly Property SiteRegionOptionConflict As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ SiteRegionOptionConflict {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SiteFailures Class
  Autodesk.Revit.DB Namespace